app/views/providers/_result.html.erb

        <p><%= provider.email %></p>
        <% provider.assessments.each do |a| %>
---
SELECT "assessments".* FROM "assessments" INNER JOIN "competencies" ON "assessments"."id" = "competencies"."assessment_id" WHERE "competencies"."provider_id" = $1  [["provider_id", 1]]