app/controllers/providers_controller.rb

  def index
    feelings = []
    feelings << Feeling.find_by(word: params[:feeling])
---
SELECT  "feelings".* FROM "feelings"  WHERE "feelings"."word" = 'stressed' LIMIT 1